---
kind: property
id: P:Autodesk.Revit.DB.PDFExportOptions.PaperPlacement
source: html/dc751e92-5a01-49c4-6287-6a7c0ef6490a.htm
---
# Autodesk.Revit.DB.PDFExportOptions.PaperPlacement Property

Paper placement of either center or offset from corner.

## Syntax (C#)
```csharp
public PaperPlacementType PaperPlacement { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration